#+STARTUP: overview
# Emacs-konfiguraatio tiedosto
# Author: Tommi Salenius
# Created: La 9.6.2018
# License: GPL (2018)
# ---
Tämän tiedoston tarkoituksena on auttaa pitämään Emacs-kustomoinnit
hyvin organisoituna. Ideana on, että ohjelman käynnistyessä ajettava
[[file:/Users/tommi/.emacs.d/init.el][init.el-tiedosto]] ajaa läpi komennon, joka parsii tässä tiedostossa olevat
Elisp-komennot ja ajaa ne sitten Lisp-tulkin läpi asiaankuuluvin seurauksin.

** Käyttäjätiedot
#+name: user-info
| Muuttuja         | Arvo                      |
|------------------+---------------------------|
| sähköpostiosoite | "tommisalenius@gmail.com" |
#+BEGIN_SRC emacs-lisp :exports code :var user-info=user-info :results list
(setq sähköpostiosoite "tommisalenius@gmail.com")
#+end_SRC

#+RESULTS:
: - tommisalenius@gmail.com

*** Tiedoston sisällä liikkuminen
Seuraavat näppäinoikotiet on tarkoitettu helpottamaan liikkumista saman
bufferin ja ikkunan sisällä.

#+name: normaalimuodot
| Näppäinyhdistelmä | Funktio               |
|-------------------+-----------------------|
| §                 | 'end-of-line          |
| zj                | 'evil-scroll-down     |
| zk                | 'evil-scroll-up       |
| '                 | 'evil-search-forward  |
| +                 | 'evil-search-backward |

#+BEGIN_SRC emacs-lisp :exports code :var normaalimuodot=normaalimuodot
  (mapc (lambda (x) (lue-merkki-pari x 'evil/n t)) normaalimuodot)
#+END_SRC 

#+RESULTS:
| §  | 'end-of-line          |
| zj | 'evil-scroll-down     |
| zk | 'evil-scroll-up       |
| '  | 'evil-search-forward  |
| +  | 'evil-search-backward |

*** Ikkunat
Hallitse ikkunoita ja liiku niiden välillä

#+name: evil-ikkunat
| Aktiviteetti                   | Funktio                    |
|--------------------------------+----------------------------|
| vaihda-ikkunaa                 | 'ace-window                |
| pilko-ikkuna-horisontaalisesti | 'split-window-horizontally |
| pilko-ikkuna-vertikaalisesti   | 'split-window-vertically   |
| poista-aktiivinen-ikkuna       | 'delete-window             |
| poista-muut-ikkunat            | 'delete-other-windows      |
#+BEGIN_SRC emacs-lisp :exports code :var evil-ikkunat=evil-ikkunat
  (taulukko-eval 'evil/n evil-ikkunat nil)
  ;; (evil/n vaihda-ikkunaa 'ace-window) ; Mahdollista liikkuminen ikkunoiden välillä
  ;; (evil/n pilko-ikkuna-horisontaalisesti 'split-window-horizontally)
  ;; (evil/n pilko-ikkuna-vertikaalisesti 'split-window-vertically)
  ;; (evil/n poista-aktiivinen-ikkuna 'delete-window)
  ;; (evil/n poista-muut-ikkunat 'delete-other-windows)

#+END_SRC 

#+RESULTS:
| vaihda-ikkunaa                 | 'ace-window                |
| pilko-ikkuna-horisontaalisesti | 'split-window-horizontally |
| pilko-ikkuna-vertikaalisesti   | 'split-window-vertically   |
| poista-aktiivinen-ikkuna       | 'delete-window             |
| poista-muut-ikkunat            | 'delete-other-windows      |

*** Bufferit
Hallitse buffereita ja liiku niiden välillä

#+name: puskurit
| Näppäinyhdistelmä     | Funktio           |
|-----------------------+-------------------|
| tallennus             | 'save-buffer      |
| buffer-valikko        | 'ibuffer          |
| tapa-aukioleva-buffer | 'kill-this-buffer |
| seuraava-buffer       | 'evil-next-buffer |
| edellinen-buffer      | 'evil-prev-buffer |
#+BEGIN_SRC emacs-lisp :exports code :var puskurit=puskurit
  (taulukko-eval 'evil/n puskurit nil)
#+END_SRC 

#+RESULTS:
| tallennus             | 'save-buffer      |
| buffer-valikko        | 'ibuffer          |
| tapa-aukioleva-buffer | 'kill-this-buffer |
| seuraava-buffer       | 'evil-next-buffer |
| edellinen-buffer      | 'evil-prev-buffer |
 
*** Oikoluku / abbrev
Käytä näitä komentoja luodaksesi lennosta uusia abbrev-taulukon alkioita, 
jotka abbrev-mode oikolukee lennosta.
#+name: abbrev-taulukko
| Näppäinyhdistelmä | Funktio                    |
|-------------------+----------------------------|
| åag               | 'add-global-abbrev         |
| åam               | 'add-mode-abbrev           |
| åaig              | 'inverse-add-global-abbrev |
| åaim              | 'inverse-add-mode-abbrev   |
#+BEGIN_SRC emacs-lisp :exports code :var abbrev-taulukko=abbrev-taulukko
(taulukko-eval 'evil/n abbrev-taulukko t)
#+end_SRC

#+RESULTS:
| åag  | 'add-global-abbrev         |
| åam  | 'add-mode-abbrev           |
| åaig | 'inverse-add-global-abbrev |
| åaim | 'inverse-add-more-abbrev   |


#+BEGIN_SRC emacs-lisp

  ;; (evil/n "åag" 'add-global-abbrev)
  ;; (evil/n "åam" 'add-mode-abbrev)
  ;; (evil/n "åaig" 'inverse-add-global-abbrev)
  ;; (evil/n "åaim" 'inverse-add-mode-abbrev)

#+END_SRC 
 
*** Kirjanmerkit
Aseta kirjanmerkkejä liikkuaksesi helposti tiedostojen välillä.

#+name: kirjanmerkki-evil
| Näppäinyhdistelmä | Funktio         |
|-------------------+-----------------|
| ånm               | 'bookmark-set   |
| gm                | 'bookmark-jump  |
| ålm               | 'list-bookmarks |
#+BEGIN_SRC emacs-lisp :exports code :var kirjanmerkki-evil=kirjanmerkki-evil
(taulukko-eval 'evil/n kirjanmerkki-evil t)
#+end_SRC

#+RESULTS:
| ånm | 'bookmark-set  |
| gm  | 'bookmark-jump |

#+BEGIN_SRC emacs-lisp

  ;; (evil/n "ånm" 'bookmark-set)
  ;; (evil/n "gm" 'bookmark-jump)
  ;; (evil/n "ålm" 'list-bookmarks)

#+END_SRC 

** Swiper
Korvaa Emacsin oletushaku Swiperilla.

#+name: swiper-taulu
| Näppäinyhdistelmä | Funktio |
|-------------------+---------|
| C-s               | 'swiper |
#+BEGIN_SRC emacs-lisp :exports code :var swiper-taulu=swiper-taulu
(taulukko-eval 'evil/n swiper-taulu t)
#+end_SRC

#+RESULTS:
| C-s | 'swiper |

*** Autocompletion
Counsel-company tarjoaa mahdollisuuden etsiä vaihtoehtoja joukosta.
#+name: counsel-autokompleetio
| Näppäinyhdistelmä | Funktio          |
|-------------------+------------------|
| åd                | 'counsel-company |
#+BEGIN_SRC emacs-lisp :exports code :var counsel-autokompleetio=counsel-autokompleetio
(taulukko-eval 'evil/i counsel-autokompleetio t)
#+end_SRC

#+RESULTS:
| åd | 'counsel-company |

** Säännöllisten lausekkeiden rakentaminen
Shortcutti, jonka avulla saadaan äkkiä kaksi takakenoviivaa.
#+name: lisää-regex
| Näppäinyhdistelmä | Lopputulos        |
|-------------------+-------------------|
| åk                | (kirjoita "\\\\") |
#+BEGIN_SRC emacs-lisp :exports code :var lisää-regex=lisää-regex
  (taulukko-eval 'evil/i lisää-regex t)
#+end_SRC

#+RESULTS:
| åk | (kirjoita "\\\\") |

*** Magit
#+name: magit-komennot
| Yhdistelmä | Kuvaus                     |
|------------+----------------------------|
| åg         | Git/Magit                  |
| ågc        | Git commit                 |
| ågs        | Git status                 |
| ågt        | Git stage/add              |
| ågta       | Stageta kaikki seurattavat |
| ågtt       | Stageta aukioleva tiedosto |
| ågtf       | Stageta haluttu tiedosto   |
| ågp        | Push/pull                  |
| ågps       | Git push                   |
| ågpl       | Git pull                   |
| ågpsh      | Työnnä Githubiin tms       |
| ågpsb      | Työnnä haluttuun branchiin |
| ågplh      | Vedä Githubista tms        |
| ågplb      | Vedä halutusta branchista  |
| ågo        | Checkout/vaihda branchiin  |
| ågbb       | Katso branchit             |
| ågbc       | Checkout/vaihda branchiin  |
| ågbr       | Nimeä branch uudelleen     |

#+BEGIN_SRC emacs-lisp :exports code :var magit-komennot=magit-komennot
(mapc (lambda (x) (whichcommon (car x) (cadr x))) magit-komennot)
#+end_SRC

#+RESULTS:
| åg    | Git/Magit                  |
| ågc   | Git commit                 |
| ågs   | Git status                 |
| ågt   | Git stage/add              |
| ågta  | Stageta kaikki seurattavat |
| ågtt  | Stageta aukioleva tiedosto |
| ågtf  | Stageta haluttu tiedosto   |
| ågp   | Push/pull                  |
| ågps  | Git push                   |
| ågpl  | Git pull                   |
| ågpsh | Työnnä Githubiin tms       |
| ågpsb | Työnnä haluttuun branchiin |
| ågplh | Vedä Githubista tms        |
| ågplb | Vedä halutusta branchista  |
| ågo   | Checkout/vaihda branchiin  |
| ågbb  | Katso branchit             |
| ågbc  | Checkout/vaihda branchiin  |
| ågbr  | Nimeä branch uudelleen     |
#+END_SRC 
*** Queryt
#+name: queryt
| Yhdistelmä | Kuvaus                        |
|------------+-------------------------------|
| åq         | Tee query                     |
| åqt        | Käännä lause                  |
| åql        | Käännä sana kursorin kohdalla |
| åqc        | Emacs laskin                  |
| åqg        | Google-haku                   |

#+BEGIN_SRC emacs-lisp :exports code :var queryt=queryt

(mapc (lambda (x) (whichcommon (car x) (cadr x))) queryt)

#+END_SRC 

#+RESULTS:
| åq  | Tee query                     |
| åqt | Käännä lause                  |
| åql | Käännä sana kursorin kohdalla |
| åqc | Emacs laskin                  |
| åqg | Google-haku                   |

* Leikkikenttä
Laita tänne kaikkea höpsöttelyä.
#+name: sitaattimerkit
| Yhdistelmä | Funktio               |
|------------+-----------------------|
| ågg        | (kirjoita "Häppärää") |
#+BEGIN_SRC emacs-lisp :exports code :var sitaattimerkit=sitaattimerkit
(taulukko-eval 'evil/i sitaattimerkit t)
#+end_SRC

#+RESULTS:
| ågg | (kirjoita "Häppärää") |


#+BEGIN_SRC emacs-lisp
(message "Heihou")
#+END_SRC 
Lasketaan yhteen: 8.0
<2018-06-20 Ke>
<2018-06-21 To>

#+BEGIN_SRC emacs-lisp

  ;; (setq mode-line-format
  ;; 	(list
  ;; 	 "%b"
  ;; 	 " --- "
  ;; 	 "%m: "
  ;; 	 " --- "
  ;; 	 "rivi %l "
  ;; 	 " --- "
  ;; 	 "klo %M"
  ;; 	 ))


#+END_SRC 


# Local Variables:
# org-src-preserve-indentation: t
# End:
